_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 640, 480, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 640, 480, 32)      896       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 320, 240, 32)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 320, 240, 16)      4624      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 160, 120, 16)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 160, 120, 16)      2320      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 80, 60, 16)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 80, 60, 8)         1160      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 40, 30, 8)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 40, 30, 8)         584       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 20, 15, 8)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 20, 15, 8)         584       
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 40, 30, 8)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 40, 30, 8)         584       
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 80, 60, 8)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 80, 60, 16)        1168      
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 160, 120, 16)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 160, 120, 16)      2320      
_________________________________________________________________
up_sampling2d_4 (UpSampling2 (None, 320, 240, 16)      0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 320, 240, 32)      4640      
_________________________________________________________________
up_sampling2d_5 (UpSampling2 (None, 640, 480, 32)      0         
_________________________________________________________________
AEDOutput (Conv2D)           (None, 640, 480, 1)       289       
=================================================================
Total params: 19,169
Trainable params: 19,169
Non-trainable params: 0
_________________________________________________________________
